[
  {
    "slug": "coding-journal-as-my-readme",
    "title": "Coding Journal as my README",
    "date": "2020-06-14",
    "content": "<p>I&#39;m at the end of my mentorship now. Yet I&#39;m still no different from my past self if I didn&#39;t solve this procrastination and many other bad habits of mine. I learn programming, but I still don&#39;t know how to program myself. Thus I brace myself to start with jotting down everything that comes to mind in this note. </p><h2 id=\"why-a-coding-journal-\">Why a coding journal?</h2><p>I learned that every piece of software always comes with a documentation, or at least a README. That&#39;s why I think it&#39;s important to track this project of programming myself by using <em>Coding Journal</em>.</p><p>It can be filled with me rambling about the day but the most important part to include is <strong>tracking</strong>: <em>what have I done/learned today and how much time used to achieve it.</em> It comes in set with setting daily goal in the morning. That means the journal is first initialized in the morning with couple of goals written. Supposed this part goes by <strong>Daily Goals</strong>. And then I start coding and learning through the day until night. Before sleep I will write the <strong>Evaluation</strong> part of the Daily Journal. Here I&#39;ll write about the details in accomplishing the goals, such as:</p><ul><li>which one cleared and not</li><li>how much time needed</li><li>what gone wrong</li><li>how can it be improved</li><li>have I utilize the tools and techniques properly</li><li>which one needs more time</li><li>how long can I focus</li><li>what are the distractions, etc.</li></ul><p>Structures of the journal may be formatted later on as I figuring things out.</p><p>But the most important part of this system is <strong>perserverence</strong>. It is the pre-requisite of this project. Make sure to not miss a single day. Because the project design I made today may be a mess, but if I can repair and improve it little-by-little each day I&#39;m sure it will become something remarkable in couple of weeks.</p><h3 id=\"so-how-to-do-it-\">So, how to do it?</h3><ol><li>Start a day with planning -&gt; set 1 hour to read yesterday&#39;s journal, init today&#39;s journal, motivate and <strong>turn the switch on.</strong></li><li>Work towards the goals while implementing yesterday&#39;s evaluation.</li><li>Take a controlled rest -&gt; reward yourself or ishoma, set 1 hour rest for 3 hours of focus, <strong>turn the swicth on</strong> again. </li><li>Evaluation -&gt; set 1 hour to evaluate the day.</li></ol>"
  },
  {
    "slug": "unexecuted-plans-equal-to-trashes",
    "title": "Unexecuted plans equal to trashes",
    "date": "2020-06-18",
    "content": "<p>Today, I mean, yesterday I don&#39;t even create any goals, thus I don&#39;t have any progress at all.</p><p>But at least now I&#39;m writing some evaluation of my yesterday&#39;s laziness. You see, even trashes can be recycled.</p><p>First of all, I didn&#39;t even try to start. Every time I think &quot;<em>I should start now</em>&quot; I always ends up distracted by smartphone, manga, or anime. I think it&#39;s alright to force myself at first. I&#39;ll give name to this part as <strong>Kickstart</strong>, that is, the act of forcing myself to get into work mode.</p><p>I can picture myself in front laptop but still feels heavy to do anything. And that&#39;s alright. <strong>Kickstart</strong> only means to force me to leave all distractions and go to productive working or learning.</p><p><strong>Kickstart</strong> will be followed by <strong>Motivate</strong> or <strong>Switching-on</strong> phase that designed to fuel myself to get going.</p><p>Now that my engine&#39;s on and my fuel tank is full, it&#39;s time to <em>hit the gas</em>.</p><p>But, actually wait a moment, I need to know where the hell I&#39;m going. And as we know, I define daily goals. It must be bite-sized that can be finished in a day (actually just speculate that it can be finished in a day, after a while I will know my limits to make better prediction).</p><blockquote><p>Finish the Goals by all means!!!</p></blockquote><p>Slacking off can be detrimental in long term when it become habits.</p><p>So now, my engine&#39;s on with full tanks and my destination is clear. Finally I&#39;ll <em>hit the gas</em> for real.</p><p>Based on my experience, I&#39;d be more mindful by using 5 minutes task breakdowns. Just imagine what should be done in 5 minutes, what progress should you have in the range of 5 minutes. Create small goals, 5-minutes-chunk tasks. This way I&#39;ll be checking the clock more often. And when I&#39;m aware of the time, I can be more focused and always strive to be more efficient, because I know, consciously, that I was wasting a lot of time. I want to become <strong>faster</strong> in my work.</p><p>At the night, <strong>Evaluation</strong> should track all the categorized phases (the one written in bold). Polish each phases to build a good daily rhythm.</p>"
  },
  {
    "slug": "starting-is-easy-keeping-on-is-not",
    "title": "Starting is easy, Keeping on is not",
    "date": "2020-06-19",
    "content": "<h2 id=\"intro\">Intro</h2><p>This section will serve as reminder for me to read yesterday <strong>evaluation</strong> and try to apply it to today&#39;s system. As I wrote yesterday, I&#39;ve defined some phases that will control my flow of work at the day. (phases are written in bold)</p><p>Actually this time, I&#39;m starting with higher energy that I don&#39;t really need to spend much on <strong>kickstart, motivate or switching-on</strong>. Maybe because I didn&#39;t sleep after subuh and move my body a bit when I take my brother to work. After that I just need to take something to eat and prepare coffee. Kickstart actually is needed, forcing myself out from disctractions is really important phase. Luckily I&#39;ve found some interesting feature of android 10 called &quot;digital wellbeing&quot; that can limit the time used in certain application. Of course I set it to the most distracting app such as social medias and games. After seeing how much I&#39;ve been wasting my time on them, it&#39;s easier to move my body to do some fun coding. Then I take some caffeine and listen to my fav songs while writing this journal.</p><h2 id=\"today-s-goals\">Today&#39;s Goals</h2><ol><li>Initiate figma design on the &quot;Final Project&quot;.</li><li>Binge read the first 10 chapter of CWD.</li><li>Initiate &quot;code-per-minute&quot; repo with README (for now it served as project planner).</li></ol><p>Godspeed.</p><h2 id=\"evaluation\">Evaluation</h2><p>It turns out that this day is dissappointing. I never continue with anything after I close this file. </p><p>It kind of weird that I full of energy while I init this day. But after I left my workspace for some menial task, I can&#39;t seem to back to the work mode. It&#39;s really easy to stop in the middle, it&#39;s frighteningly easy. I know I&#39;ve been had, I&#39;ve been through this since forever. </p><p>I&#39;m pretty sure this was caused by some <em>euphoria</em> after finish some work. I somehow feel accomplished and content after some (small) work, haha. Even when, in fact that, I didn&#39;t really progressed much, I just crave to slack off. I crave for some <em>prize</em> for myself after working. This itself is not a bad attitude, I think. But the fact that I easily stop my work for some distraction is a bad news. It makes my brain record that my work is not enjoyable and make it harder to start working again. Distraction really is an instant gratification, it makes me useless! </p><p>That being said, I can&#39;t just cut off myself from all those distractions. Sometimes coding really stressful. <em>Prize</em> can be a nice breather. Besides I can&#39;t bring myself away from my hobby (anime, manga &amp; music). If it managed properly, I believe they can be motivation to improve my efficiency. In fact, I&#39;ll enjoy it even more if I do it after a hard work.</p><p>My points are:</p><ul><li>Stop being an instant gratification monkey! Cut off social medias and games on smartphone when working (use <code>don&#39;t disturb</code> or <code>focus mode</code>)</li><li>Utilize the <em>prize</em> system for motivation instead. Only watch anime after the work is DONE!</li><li>Use the same init (<strong>kickstart, motivate, switching-on</strong>) function whenever you&#39;re slacking off.</li></ul>"
  }
]
